Repository: xqsadness/QuizKid
Catalog: DefaultProject/Localizable/*.lproj/Localizable.strings
Languages: fr, ru, vi

source: History
ru: История
vi: Lịch sử

source: Math
ru: Математика
vi: Toán

source: Color
ru: Цвет
vi: Màu sắc

source: Listen
fr: Écouter
ru: Слушать
vi: Lắng nghe

source: Surrounding objects
ru: Окружающие объекты
vi: Đồ vật xung quanh

source: questions
ru: вопросы
vi: câu hỏi

source: Listen And Repeat
ru: Слушать и повторять
vi: Lắng nghe và lặp lại

source: Writing
ru: Письмо
vi: Viết

source: Languages
fr: Langue
ru: язык

source: Hi
ru: Привіт

source: Please allow access speech and voice
ru: Пожалуйста, разрешите доступ к речи и голосу

source: Go to setting
ru: Перейти к настройкам

source: Question text
fr: Texte de la question
ru: Текст вопроса
vi: Câu hỏi

source: Answer text
fr: Texte de la réponse
ru: Текст ответа
vi: Câu trả lời

source: Option text
fr: Texte de l'option
ru: Текст варианта
vi: Lựa chọn

source: Submit
fr: Soumettre
ru: Подтвердить
vi: Xác nhận

source: Next
fr: Suivant
ru: Следующий
vi: Tiếp theo

source: Done
fr: Terminé
ru: Готово
vi: Hoàn thành

source: of
ru: из
vi: trên

source: In the year 1933, France merged Truong Sa into which province?
fr: En 1933, la France a fusionné Truong Sa dans quelle province ?
ru: В 1933 году Франция присоединила Труонг Са к какой провинции?
vi: Năm 1933, Pháp sáp nhập Trường Sa vào tỉnh nào?

source: The Paracel and Spratly Islands belong to which country?
fr: Les îles Paracel et Spratly appartiennent à quel pays ?
ru: К какой стране принадлежат острова Парасель и Спратли?
vi: Quần đảo Hoàng Sa và Trường Sa thuộc quốc gia nào?

source: In March 1947, US President Truman officially launched the 'Cold War' for the purpose of?
fr: En mars 1947, le président américain Truman a officiellement lancé la 'Guerre froide' dans quel but ?
ru: В марте 1947 года президент США Труман официально начал 'Холодную войну' с какой целью?
vi: Tháng 3 năm 1947, Tổng thống Mỹ Truman chính thức khởi đầu 'Chiến tranh Lạnh' với mục đích?

source: The role of the United Nations Security Council is to?
fr: Le rôle du Conseil de sécurité des Nations Unies est de ?
ru: Какова роль Совета безопасности Организации Объединенных Наций?
vi: Vai trò của Hội đồng Bảo an Liên Hiệp Quốc là gì?

source: In the final stages of World War II, what did the Allies do to change the global situation?
fr: Dans les dernières étapes de la Seconde Guerre mondiale, que firent les Alliés pour changer la situation mondiale ?
ru: На последних стадиях Второй мировой войны союзники сделали, чтобы изменить глобальную ситуацию?
vi: Trong giai đoạn cuối của Chiến tranh Thế giới II, Đồng minh đã làm gì để thay đổi tình hình toàn cầu?

source: The fundamental cause of the Cold War after World War II was
fr: La cause fondamentale de la Guerre froide après la Seconde Guerre mondiale était
ru: Основная причина Холодной войны после Второй мировой войны заключалась в том, что
vi: Nguyên nhân cơ bản của Chiến tranh Lạnh sau Chiến tranh Thế giới II là gì?

source: Resolving disputes and conflicts in various regions through peaceful means, this is one of the contents of
fr: Résoudre les différends et les conflits dans différentes régions par des moyens pacifiques, c'est l'un des contenus de
ru: Разрешение споров и конфликтов в различных регионах путем мирных средств, это одно из содержания
vi: Giải quyết tranh chấp và xung đột ở các vùng khác nhau thông qua các biện pháp hòa bình, đây là một trong các nội dung của

source: When was history created?
fr: Quand l'histoire a-t-elle été créée ?
ru: Когда была создана история?
vi: Lịch sử được tạo ra khi nào?

source: About 5,000 years
fr: Environ 5 000 ans auparavant
ru: Примерно 5 000 лет назад
vi: Khoảng 5.000 năm trước

source: Who invented history?
fr: Qui a inventé l'histoire ?
ru: Кто изобрел историю?
vi: Ai đã phát minh ra lịch sử?

source: Ba Ria
fr: Bà Rịa
ru: Ба Риа
vi: Bà Rịa

source: Kien Giang
fr: Kiên Giang
ru: Киенгианг
vi: Kiên Giang

source: Gia Dinh
fr: Gia Định
ru: Гиадин
vi: Gia Định

source: Khanh Hoa
fr: Khánh Hòa
ru: Кханьхоа
vi: Khánh Hòa

source: Vietnam
fr: Viêt Nam
ru: Вьетнам
vi: Việt Nam

source: Thailand
fr: Thaïlande
ru: Таиланд
vi: Thái Lan

source: Laos
ru: Лаос
vi: Lào

source: China
fr: Chine
ru: Китай
vi: Trung Quốc

source: To counter the Soviet Union and socialist countries.
fr: Pour contrer l'Union soviétique et les pays socialistes.
ru: Для противостояния Советскому Союзу и социалистическим странам.
vi: Để chống lại Liên Xô và các nước xã hội chủ nghĩa.

source: To maintain world peace and security after the war.
fr: Pour maintenir la paix et la sécurité mondiales après la guerre.
ru: Для поддержания мирового мира и безопасности после войны.
vi: Để duy trì hòa bình và an ninh thế giới sau chiến tranh.

source: To appease the workers' struggle in capitalist countries.
fr: Pour apaiser la lutte des travailleurs dans les pays capitalistes.
ru: Для умиротворения борьбы рабочих в капиталистических странах.
vi: Để xoa dịu cuộc đấu tranh của công nhân ở các nước tư bản.

source: To counter the liberation movements in Latin America.
fr: Pour contrer les mouvements de libération en Amérique latine.
ru: Для противодействия освободительным движениям в Латинской Америке.
vi: Để chống lại các phong trào giải phóng ở châu Mỹ Latinh.

source: Play a primary role in maintaining global peace and security.
fr: Jouer un rôle primordial dans le maintien de la paix et de la sécurité mondiales.
ru: Играть первостепенную роль в поддержании мирового мира и безопасности.
vi: Đóng vai trò chính trong việc duy trì hòa bình và an ninh toàn cầu.

source: Protect the fundamental national rights of countries.
fr: Protéger les droits nationaux fondamentaux des pays.
ru: Защищать основные национальные права стран.
vi: Bảo vệ quyền cơ bản của các quốc gia.

source: Ensure peace for nations.
fr: Assurer la paix pour les nations.
ru: Обеспечивать мир для наций.
vi: Đảm bảo hòa bình cho các quốc gia.

source: Prevent countries from violating each other's sovereignty.
fr: Empêcher les pays de violer la souveraineté les uns des autres.
ru: Предотвращать нарушение суверенитета стран друг другом.
vi: Ngăn chặn các quốc gia vi phạm chủ quyền của nhau.

source: Launched a massive assault on Germany's capital Berlin.
fr: Lancé une attaque massive sur la capitale allemande Berlin.
ru: Начали масштабное наступление на столицу Германии Берлин.
vi: Tiến hành cuộc tấn công toàn diện vào thủ đô Berlin của Đức.

source: Urgently demanded a complete defeat of the Nazi powers.
fr: A exigé de toute urgence la défaite totale des puissances nazies.
ru: Требовали срочного полного поражения нацистских сил.
vi: Đòi hỏi việc tiêu diệt hoàn toàn quyền lực của Đảng Quốc xã Đức.

source: Rapidly organized a new world order after the war.
fr: Organisé rapidement un nouvel ordre mondial après la guerre.
ru: Быстро организовали новый мировой порядок после войны.
vi: Nhanh chóng tổ chức một trật tự thế giới mới sau chiến tranh.

source: Convened the Yalta Conference (USSR) from February 04 to February 11, 1945.
fr: Convoqué la Conférence de Yalta (URSS) du 04 au 11 février 1945.
ru: Созвали Ялтинскую конференцию (СССР) с 4 по 11 февраля 1945 года.
vi: Triệu tập Hội nghị Yalta (Liên Xô) từ ngày 04 đến ngày 11 tháng 2 năm 1945.

source: The world was divided into two camps: capitalism and socialism.
fr: Le monde était divisé en deux camps : le capitalisme et le socialisme.
ru: Мир был разделен на два лагеря: капитализм и социализм.
vi: Thế giới được chia thành hai phe: chủ nghĩa tư bản và chủ nghĩa xã hội.

source: Unsatisfactory post-World War II division of influence.
fr: Division insatisfaisante de l'influence après la Seconde Guerre mondiale.
ru: Недостаточное деление влияния после Второй мировой войны.
vi: Sự chia cắt không hài lòng sau Chiến tranh Thế giới II.

source: Disagreements at the Yalta Conference.
fr: Désaccords lors de la Conférence de Yalta.
ru: Разногласия на Ялтинской конференции.
vi: Sự không đồng tình tại Hội nghị Yalta.

source: US not achieving its goals at the Yalta Conference.
fr: Les États-Unis n'ont pas atteint leurs objectifs à la Conférence de Yalta.
ru: США не достигли своих целей на Ялтинской конференции.
vi: Mỹ không đạt được mục tiêu của mình tại Hội nghị Yalta.

source: The principles of the United Nations.
fr: Les principes des Nations Unies.
ru: Принципы Организации Объединенных Наций.
vi: Nguyên tắc của Liên Hiệp Quốc.

source: The role of the United Nations.
fr: Le rôle des Nations Unies.
ru: Роль Организации Объединенных Наций.
vi: Vai trò của Liên Hiệp Quốc.

source: Resolutions of the Yalta Conference.
fr: Résolutions de la Conférence de Yalta.
ru: Резолюции Ялтинской конференции.
vi: Các nghị quyết của Hội nghị Yalta.

source: The purpose of the United Nations.
fr: L'objectif des Nations Unies.
ru: Цель Организации Объединенных Наций.
vi: Mục đích của Liên Hiệp Quốc.

source: 5 and 4 BC
fr: 5 et 4 av. J.-C.
ru: 5 и 4 года до н. э.
vi: Năm 5 và 4 TCN

source: 6 and 7 BC
fr: 6 et 7 av. J.-C.
ru: 6 и 7 года до н. э.
vi: Năm 6 và 7 TCN

source: 1 AND 3 BC
fr: 1 et 3 av. J.-C.
ru: 1 и 3 года до н. э.
vi: Năm 1 và 3 TCN

source: 2 and 4 BC
fr: 2 et 4 av. J.-C.
ru: 2 и 4 года до н. э.
vi: Năm 2 và 4 TCN

source: About 4,000 years
fr: Environ 4 000 ans auparavant
ru: Примерно 4 000 лет назад
vi: Khoảng 4.000 năm trước

source: About 3,000 years
fr: Environ 3 000 ans auparavant
ru: Примерно 3 000 лет назад
vi: Khoảng 3.000 năm trước

source: About 2,000 years
fr: Environ 2 000 ans auparavant
ru: Примерно 2 000 лет назад
vi: Khoảng 2.000 năm trước

source: About 1,000 years
fr: Environ 1 000 ans auparavant
ru: Примерно 1 000 лет назад
vi: Khoảng 1.000 năm trước

source: What is 5 + 3?
fr: Que vaut 5 + 3 ?
ru: 5 + 3 равно чему?
vi: 5 + 3 bằng bao nhiêu?

source: How many fingers are there on each of your hands?
fr: Combien y a-t-il de doigts sur chacune de vos mains ?
ru: Сколько пальцев на каждой руке?
vi: Có bao nhiêu ngón tay trên mỗi bàn tay của bạn?

source: If you have 4 apples and you give one to your friend, how many apples do you have left?
fr: Si vous avez 4 pommes et que vous en donnez une à votre ami, combien de pommes vous reste-t-il ?
ru: Если у вас есть 4 яблока, и вы отдаете одно своему другу, сколько яблок у вас останется?
vi: Nếu bạn có 4 quả táo và bạn đưa một quả cho bạn mình, hỏi bạn còn lại bao nhiêu quả táo?

source: How many faces does a cube have?
fr: Combien de faces a un cube ?
ru: Сколько граней у куба?
vi: Khối lập phương có bao nhiêu mặt?

source: What is 8 x 0?
fr: Que vaut 8 x 0 ?
ru: 8 x 0 равно чему?
vi: 8 x 0 bằng bao nhiêu?

source: If you have 10 fingers, how many fingers do you need to count to 20?
fr: Si vous avez 10 doigts, combien de doigts avez-vous besoin de compter jusqu'à 20 ?
ru: Если у вас есть 10 пальцев, сколько пальцев вам нужно, чтобы досчитать до 20?
vi: Nếu bạn có 10 ngón tay, bạn cần đếm bao nhiêu ngón tay để có 20?

source: How many legs does a dog have?
fr: Combien de pattes a un chien ?
ru: Сколько ног у собаки?
vi: Con chó có bao nhiêu chân?

source: What is 7 x 2?
fr: Que vaut 7 x 2 ?
ru: 7 x 2 равно чему?
vi: 7 x 2 bằng bao nhiêu?

source: What is 4 + 7?
fr: Que vaut 4 + 7 ?
ru: 4 + 7 равно чему?
vi: 4 + 7 bằng bao nhiêu?

source: If a cat is in front of a chicken coop, the chicken coop is in front of the house, and the house is in front of a pond, then what is in front of a window?
fr: Si un chat est devant un poulailler, le poulailler est devant la maison, et la maison est devant un étang, qu'y a-t-il devant une fenêtre ?
ru: Если кошка перед курятником, курятник перед домом, а дом перед прудом, то что перед окном?
vi: Nếu mèo ở trước chuồng gà, chuồng gà ở trước nhà, ao ở trước nhà, thì trước cửa sổ là gì?

source: There is a bridge with 5 ducks on it. Under the bridge, there are 4 ducks. How many ducks are there in total?
fr: Il y a un pont avec 5 canards dessus. Sous le pont, il y a 4 canards. Combien de canards y a-t-il au total ?
ru: На мосту 5 уток. Под мостом 4 утки. Сколько всего уток?
vi: Trên cầu có 5 con vịt, dưới cầu có 4 con vịt. Hỏi có tất cả bao nhiêu con vịt?

source: You have 5 apples. You ate 2. How many apples do you have left?
fr: Vous avez 5 pommes. Vous en avez mangé 2. Combien de pommes vous reste-t-il ?
ru: У вас есть 5 яблок. Вы съели 2. Сколько у вас осталось яблок?
vi: Bạn có 5 quả táo. Bạn đã ăn 2. Bạn còn lại bao nhiêu quả táo?

source: If today is Saturday, what day is tomorrow?
fr: Si aujourd'hui est samedi, quel jour est demain ?
ru: Если сегодня суббота, какой день будет завтра?
vi: Nếu hôm nay là thứ bảy, ngày mai là ngày nào?

source: If you walk 10 steps along a road, where are you?
fr: Si vous faites 10 pas le long d'un chemin, où êtes-vous ?
ru: Если вы сделаете 10 шагов вдоль дороги, где вы будете?
vi: Nếu bạn đi bộ 10 bước dọc theo một con đường, bạn đang ở đâu?

source: You have 2 red balls, 3 blue balls, and 1 yellow ball. If you randomly draw a ball from the bag, how many times do you need to draw to ensure you have at least one blue ball?
fr: Vous avez 2 balles rouges, 3 balles bleues et 1 balle jaune. Si vous tirez au hasard une balle du sac, combien de fois devez-vous la tirer pour vous assurer d'avoir au moins une balle bleue ?
ru: У вас есть 2 красные мяча, 3 синих мяча и 1 желтый мяч. Если вы случайным образом вытаскиваете мяч из мешка, сколько раз вам нужно вытащить, чтобы гарантировать, что у вас есть хотя бы один синий мяч?
vi: Bạn có 2 quả bóng màu đỏ, 3 quả bóng màu xanh và 1 quả bóng màu vàng. Nếu lấy ngẫu nhiên một quả bóng từ trong túi, bạn cần rút bao nhiêu lần để đảm bảo có ít nhất một quả bóng màu xanh?

source: Cat
fr: Chat
ru: Кошка
vi: Mèo

source: Chicken
fr: Poulet
ru: Курица
vi: Gà

source: Fish
fr: Poisson
ru: Рыба
vi: Cá

source: Dog
fr: Chien
ru: Собака
vi: Chó

source: Sunday
fr: Dimanche
ru: Воскресенье
vi: Chủ nhật

source: Saturday
fr: Samedi
ru: Суббота
vi: Thứ bảy

source: Monday
fr: Lundi
ru: Понедельник
vi: Thứ hai

source: Friday
fr: Vendredi
ru: Пятница
vi: Thứ sáu

source: At the end of the road
fr: Au bout de la route
ru: В конце дороги
vi: Ở cuối con đường

source: At the beginning of the road
fr: Au début de la route
ru: В начале дороги
vi: Ở đầu đường

source: In the middle of the road
fr: Au milieu de la route
ru: В середине дороги
vi: Ở giữa đường

source: Cannot be determined
fr: Ne peut pas être déterminé
ru: Невозможно определить
vi: Không thể xác định

source: 4 times
fr: 4 fois
ru: 4 раза
vi: 4 lần

source: 2 times
fr: 2 fois
ru: 2 раза
vi: 2 lần

source: 3 times
fr: 3 fois
ru: 3 раза
vi: 3 lần

source: 6 times
fr: 6 fois
ru: 6 раза
vi: 6 lần

source: What color is this fruit?
fr: De quelle couleur est ce fruit ?
ru: Какого цвета этот фрукт?
vi: Quả này màu gì?

source: What color is this cherry?
fr: De quelle couleur est cette cerise ?
ru: Какого цвета эта вишня?
vi: Quả cherry này màu gì?

source: What color is this dog?
fr: De quelle couleur est ce chien ?
ru: Какого цвета эта собака?
vi: Chú chó này màu gì?

source: What color is this?
fr: De quelle couleur est ceci ?
ru: Какого цвета это?
vi: Đây là màu gì?

source: What color is the girl's dress?
fr: De quelle couleur est la robe de la fille ?
ru: Какого цвета платье девочки?
vi: Váy của cô gái màu gì?

source: What color is this rabbit?
fr: De quelle couleur est ce lapin ?
ru: Какого цвета этот кролик?
vi: Con thỏ này màu gì?

source: What color is the inside of this watermelon?
fr: De quelle couleur est l'intérieur de cette pastèque ?
ru: Какого цвета внутри этот арбуз?
vi: Bên trong quả dưa hấu này có màu gì?

source: Orange
ru: Оранжевый
vi: Cam

source: Red
fr: Rouge
ru: Красный
vi: Đỏ

source: Yellow
fr: Jaune
ru: Желтый
vi: Vàng

source: Green
fr: Vert
ru: Зеленый
vi: Xanh lá

source: Purple
fr: Violet
ru: Фиолетовый
vi: Tím

source: White
fr: Blanc
ru: Белый
vi: Trắng

source: Black
fr: Noir
ru: Черный
vi: Đen

source: Brown
fr: Marron
ru: Коричневый
vi: Nâu

source: Gray
fr: Gris
ru: Серый
vi: Xám

source: Blue
fr: Bleu
ru: Синий
vi: Xanh da trời

source: Listen and choose the correct answer
fr: Écoutez et choisissez la bonne réponse
ru: Слушайте и выберите правильный ответ
vi: Nghe và chọn câu trả lời đúng

source: Shoes
fr: Chaussures
ru: Обувь
vi: Giày

source: What is she wearing?
fr: Que porte-t-elle ?
ru: Что она носит?
vi: Cô ấy đang mặc gì?

source: Gloves
fr: Gants
ru: Перчатки
vi: Găng tay

source: Coat
fr: Manteau
ru: Пальто
vi: Áo khoác

source: Hat
fr: Chapeau
ru: Шапка
vi: Mũ

source: Mining
fr: Exploitation minière
ru: Добыча полезных ископаемых
vi: Khai thác

source: What is he doing?
fr: Que fait-il ?
ru: Что он делает?
vi: Anh ấy đang làm gì?

source: Sheep farming
fr: Élevage de moutons
ru: Овцеводство
vi: Nuôi cừu

source: Gardening
fr: Jardinage
ru: Садоводство
vi: Làm vườn

source: Baking
fr: Cuisson
ru: Выпечка
vi: Nướng bánh

source: Planting
fr: Plantation
ru: Посадка растений
vi: Trồng trọt

source: Cooking rice
fr: Cuisson du riz
ru: Приготовление риса
vi: Nấu cơm

source: Raising chickens
fr: Élevage de poulets
ru: Выращивание кур
vi: Nuôi gà

source: Elephant
fr: Éléphant
ru: Слон
vi: Voi

source: What animal is this?
fr: Quel animal est-ce ?
ru: Какое это животное?
vi: Con vật này là gì?

source: Pig
fr: Cochon
ru: Свинья
vi: Lợn

source: Rose
ru: Роза
vi: Hoa hồng

source: What flower is this?
fr: Quelle fleur est-ce ?
ru: Какой это цветок?
vi: Loài hoa này là gì?

source: Wild grass flower
fr: Fleur d'herbe sauvage
ru: Цветок дикой травы
vi: Hoa cỏ dại

source: Sunflower
fr: Tournesol
ru: Подсолнух
vi: Hoa hướng dương

source: Chrysanthemum
fr: Chrysanthème
ru: Хризантема
vi: Hoa cúc

source: Mouth
fr: Bouche
ru: Рот
vi: Miệng

source: What part of the body is this?
fr: Quelle partie du corps est-ce ?
ru: Что это за часть тела?
vi: Phần nào của cơ thể là này?

source: Nose
fr: Nez
ru: Нос
vi: Mũi

source: Eye
fr: Œil
ru: Глаз
vi: Mắt

source: Ear
fr: Oreille
ru: Ухо
vi: Tai

source: Sun
fr: Soleil
ru: Солнце
vi: Mặt trời

source: What is this?
fr: Qu'est-ce que c'est ?
ru: Что это?
vi: Cái này là gì?

source: Moon
fr: Lune
ru: Луна
vi: Mặt trăng

source: Mercury
fr: Mercure
ru: Меркурий
vi: Sao Thủy

source: Venus
fr: Vénus
ru: Венера
vi: Sao Kim

source: Planet
fr: Planète
ru: Планета
vi: Hành tinh

source: Onion
fr: Oignon
ru: Лук
vi: Hành tây

source: Leafy greens
fr: Légumes à feuilles
ru: Листовые овощи
vi: Rau xanh lá

source: Action
ru: Действие
vi: Hành động

source: Computer
fr: Ordinateur
ru: Компьютер
vi: Máy tính

source: Desktop computer
fr: Ordinateur de bureau
ru: Настольный компьютер
vi: Máy tính để bàn

source: Airplane
fr: Avion
ru: Самолет
vi: Máy bay

source: Projector
fr: Projecteur
ru: Проектор
vi: Máy chiếu

source: Baby
fr: Bébé
ru: Ребенок
vi: Em bé

source: What is he?
fr: Qu'est-ce qu'il est ?
ru: Кто он?
vi: Anh ấy là gì?

source: Youngest
fr: Le plus jeune
ru: Самый молодой
vi: Người nhỏ nhất

source: Well-behaved
fr: Sage
ru: Хорошо воспитанный
vi: Ngoan ngoãn

source: Grown-up
fr: Adulte
ru: Взрослый
vi: Người lớn

source: Watermelon
fr: Pastèque
ru: Арбуз
vi: Dưa hấu

source: Banana Pepper
fr: Piment banane
ru: Банановый перец
vi: Ớt chuông chuối

source: Brown Rabbit
fr: Lapin brun
ru: Коричневый кролик
vi: Thỏ nâu

source: Ao Dai
ru: Ао Дай
vi: Áo Dài

source: Strawberry
fr: Fraise
ru: Клубника
vi: Dâu tây

source: Rooster
fr: Coq
ru: Петух
vi: Gà trống

source: White Dog
fr: Chien blanc
ru: Белая собака
vi: Chó trắng

source: Cherry
fr: Cerise
ru: Вишня
vi: Anh đào

source: Car
fr: Voiture
ru: Автомобиль
vi: Ô tô

source: Surrounding Object
ru: Об'єкт оточення

source: You have run out of lives
ru: У вас закончились жизни

source: Play Again
ru: Играть снова

source: Tap on the corresponding pairs
ru: Нажмите на соответствующие пары

source: How are you
fr: Comment ça va
ru: Как ты?
vi: Bạn khỏe không

source: I can see
fr: Je peux voir
ru: Я вижу
vi: Tớ thấy được

source: I love you
fr: Je t'aime
ru: Я тебя люблю
vi: Tớ yêu cậu

source: Bread
fr: Pain
ru: Хлеб
vi: Bánh mì

source: Listen to music
fr: Écouter de la musique
ru: Слушать музыку
vi: Nghe nhạc

source: Watch TV
fr: Regarder la télévision
ru: Смотреть телевизор
vi: Xem TV

source: Do exercise
fr: Faire de l'exercice
ru: Заниматься упражнениями
vi: Tập thể dục

source: Breakfast
fr: Petit-déjeuner
ru: Завтрак
vi: Bữa sáng

source: I like it
fr: Ça me plaît
ru: Мне это нравится
vi: Tớ thích nó

source: Fine, thank you!
fr: Ça va bien, merci !
ru: Хорошо, спасибо!
vi: Khỏe, cảm ơn cậu!

source: Repeat what you hear
ru: Повторите то, что вы слышите

source: Tap to speak
ru: Нажмите, чтобы говорить

source: Listen and repeat
ru: Слушайте и повторяйте

source: Hide
ru: Скрыть

source: Show
ru: Показать

source: Mean:
ru: Значение:

source: Again
ru: Снова

source: Good bye
fr: Au revoir
ru: До свидания
vi: Chào tạm biệt

source: Bye
fr: Salut
ru: Пока
vi: Tạm biệt

source: Fine
fr: Bien
ru: Хорошо
vi: Ổn

source: Go
fr: Aller
ru: Иди
vi: Đi

source: See
fr: Voir
ru: Видеть
vi: Nhìn thấy

source: Come here
fr: Viens ici
ru: Иди сюда
vi: Đến đây

source: Listen and rewrite the following sentence
ru: Слушайте и перепишите следующее предложение

source: Tap to listen
ru: Коснитесь, чтобы слушать

source: Enter here
ru: Введите здесь

source: CHECK
ru: ПРОВЕРИТЬ

source: Answer:
ru: Ответ:

source: CONTINUE
ru: ПРОДОЛЖИТЬ

source: Good morning
fr: Bonjour
ru: Доброе утро
vi: Chào buổi sáng

source: Good evening
fr: Bonsoir
ru: Добрый вечер
vi: Chào buổi tối

source: Perfect
ru: Прекрасно

source: Wrong
ru: Неверно

source: You didn't get any question right !
ru: Вы не ответили ни на один вопрос правильно!

source: Congralutions! You have scored
ru: Поздравляем! Вы набрали

source: Back to home
ru: Вернуться на главную

source: Out of
ru: из

source: Select an answer
vi: Chọn 1 đán án đúng

source: Greece
fr: Grèce
vi: Hy Lạp

source: VietNam
fr: Viêt Nam
vi: Việt Nam

source: Russia
fr: Russie
vi: Nga

source: America
fr: Amérique
vi: Mỹ

source: How are you?
fr: Comment ça va ?
vi: Cậu khỏe không?

source: Histoire
fr: Lịch sử

source: Mathématiques
fr: Math
